src/Catalogs/ШаблоныСообщений/ШаблоныСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3bf9e05f-3d68-4087-880c-d7121ba61651">
  <name>ШаблоныСообщений</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>табАид_ПредназначенДляГолосовогоСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="5814cb3a-8f7c-45b4-a590-b69d4912120f">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="589e73a1-f4a9-44c0-b103-b04b9442acbf">
    <name>ПредназначенДляSMS</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="abc5a5fb-237f-4335-b03d-881cbb8c39ba">
    <name>ПредназначенДляВводаНаОсновании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bd60e4b1-4d7c-4169-8359-8367163abb99">
    <name>ПредназначенДляЭлектронныхПисем</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8368e1fa-da0c-4a9b-9d50-a122933c7899">
    <name>ВладелецШаблона</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>табАид_Прощание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="4024d8b7-07d8-4d0b-91d5-01703dd89c6f">
    <name>ВнешняяОбработка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9c3f19f1-acfa-43f3-8b1a-dd4c07be685b">
    <name>ТемаПисьма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9c504315-376b-4d27-bb23-11309e1c7470">
    <name>ОтправлятьВТранслите</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f86f24d2-9a83-47ae-9d95-b49a0a295770">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="293c7699-06c9-4857-a7d5-1d0e7acc7fb5">
    <name>ПолноеИмяТипаПараметраВводаНаОсновании</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a7f32a7-5320-48de-ab68-9e8bb8de1b71">
    <name>УпаковатьВАрхив</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2f26970e-b964-43e2-8d6d-999bbc577689">
    <name>ТранслитерироватьИменаФайлов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5c17a594-eb0b-4cdf-af35-0eaba968e065">
    <name>ПодписьИПечать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e489f89-3371-4e57-8e2b-360f08db1a46">
    <name>ТекстШаблонаSMS</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="17477f72-0622-445c-9cb7-2c5a5a65bbe0">
    <name>Параметры</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

src/Enums/СпособыРедактированияЭлектронныхПисем/СпособыРедактированияЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f152945b-2a7b-449e-a915-176166af7bac">
  <name>СпособыРедактированияЭлектронныхПисем</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="77f5d86a-7fae-4490-9740-0e31102dab5c">
    <name>ОбычныйТекст</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5a54bc1a-d178-412c-bf4a-cf92d7f141aa">
    <name>HTML</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ШаблоныСообщений/Forms/ФормаСписка/Module.bsl
&НаСервере
&Вместо("ИнициализироватьОтборы")
Процедура табАид_ИнициализироватьОтборы()
	
	Элементы.НазначениеФильтр.СписокВыбора.Очистить();
	Элементы.ШаблонДляФильтр.СписокВыбора.Очистить();
	
	Список.Параметры.УстановитьЗначениеПараметра("Назначение", "");
	
	ВидыШаблонов = ШаблоныСообщенийСлужебный.ВидыШаблонов();
	//+табАид
	
	ВидыШаблонов.Вставить(0, НСтр("ru = 'Электронных писем, SMS и голосовых сообщений'"), НСтр("ru = 'Электронных писем, SMS и голосовых сообщений'"));
	//-табАид
	
	Список.Параметры.УстановитьЗначениеПараметра("СообщениеSMS", ВидыШаблонов.НайтиПоЗначению("SMS").Представление);
	Список.Параметры.УстановитьЗначениеПараметра("ЭлектроннаяПочта", ВидыШаблонов.НайтиПоЗначению("Email").Представление);
	//+табАид
	Список.Параметры.УстановитьЗначениеПараметра("ГолосовоеСообщение", ВидыШаблонов.НайтиПоЗначению("ГолосовоеСообщение").Представление);
	//-табАид
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьКонтекстныеШаблоны", Ложь);
	
	Для каждого ВидШаблона Из ВидыШаблонов Цикл
		Элементы.ШаблонДляФильтр.СписокВыбора.Добавить(ВидШаблона.Значение, ВидШаблона.Представление);
	КонецЦикла;
	
	Элементы.НазначениеФильтр.СписокВыбора.Добавить("", НСтр("ru = 'Все'"));
	
	ОбщийПредставление = НСтр("ru = 'Общий'");
	Список.Параметры.УстановитьЗначениеПараметра("Общий",    ОбщийПредставление);
	Элементы.НазначениеФильтр.СписокВыбора.Добавить("Общий", ОбщийПредставление);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШаблоныСообщений.Назначение КАК Назначение,
	|	ШаблоныСообщений.ПолноеИмяТипаПараметраВводаНаОсновании КАК ПолноеИмяТипаПараметраВводаНаОсновании
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	ШаблоныСообщений.Назначение <> """" И ШаблоныСообщений.Назначение <> ""Служебный""
	|	И ШаблоныСообщений.Назначение <> &Общий
	|
	|СГРУППИРОВАТЬ ПО
	|	ШаблоныСообщений.Назначение, ШаблоныСообщений.ПолноеИмяТипаПараметраВводаНаОсновании
	|
	|УПОРЯДОЧИТЬ ПО
	|	Назначение";
	
	Запрос.УстановитьПараметр("Общий", ОбщийПредставление);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		Элементы.НазначениеФильтр.СписокВыбора.Добавить(РезультатЗапроса.ПолноеИмяТипаПараметраВводаНаОсновании, РезультатЗапроса.Назначение);
	КонецЦикла;
	
	Назначение = "";
	//+таб
	ШаблонДля = НСтр("ru = 'Электронных писем, SMS и голосовых сообщений'");
	//-таб
КонецПроцедуры

&НаКлиенте
Процедура табАид_ШаблонДляФильтрОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = "SMS" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ШаблонДля", НСтр("ru = 'Сообщения SMS'"), ВидСравненияКомпоновкиДанных.Равно);
	ИначеЕсли ВыбранноеЗначение = "Email" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ШаблонДля", НСтр("ru = 'Электронного письма'"), ВидСравненияКомпоновкиДанных.Равно);
		//+табАид
	ИначеЕсли ВыбранноеЗначение = "ГолосовоеСообщение" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ШаблонДля", НСтр("ru = 'Голосовое сообщение'"), ВидСравненияКомпоновкиДанных.Равно);
		//-табАид
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "ШаблонДля");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура табАид_ДобавитьКомандыНаСервере()
	
	//Добавляем новую команду
	КомандаСоздатьГС = ЭтотОбъект.Команды.Добавить("СоздатьШаблонГолосовогоСообщения");
	КомандаСоздатьГС.Действие  = "табАид_СоздатьШаблонГолосовогоСообщения";
	КомандаСоздатьГС.Заголовок = "Голосового сообщения";
	КомандаСоздатьГС.Подсказка = "Создать шаблон голосового сообщения";
	
	//Добавляем новую кнопку
	КнопкаФормыСоздатьГС = Элементы.Добавить("кн_КомандаСоздатьГС", Тип("КнопкаФормы"), Элементы.ФормаГруппаСоздать);
	КнопкаФормыСоздатьГС.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормыСоздатьГС.ИмяКоманды = "СоздатьШаблонГолосовогоСообщения";
	
КонецПроцедуры

&НаКлиенте
Процедура табАид_СоздатьШаблонГолосовогоСообщения()
	СоздатьШаблон("ГолосовоеСообщение");	
КонецПроцедуры

&НаКлиенте
&Вместо("СоздатьШаблон")
Процедура табАид_СоздатьШаблон(ТипСообщения)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидСообщения",           ТипСообщения);
	ПараметрыФормы.Вставить("ПолноеИмяТипаОснования", Назначение);
	ПараметрыФормы.Вставить("МожноМенятьНазначение",  Истина);
	//+табАид
	ПараметрыФормы.Вставить("ЭтоТАБАИД",  				  Истина);
	//-табАид
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура табАид_ЗаполнитьШаблоныПоУмолчаниюНаСервере()
	Макет = Справочники.ШаблоныСообщений.ПолучитьМакет("табАид_Макет");
	
	КоличествоСтрок = Макет.ВысотаТаблицы;
	СоответствиеКолонок = табАид_ПолучитьСоответствиеКолонок();
	Масс = новый Массив;
	Для НомерСтроки = 2 По КоличествоСтрок Цикл 
		СтрокаДанных = "";
		СтруктураДанных = Новый Структура();
		Для Каждого ПолеСоответствия Из СоответствиеКолонок Цикл
			ТекущаяОбласть = Макет.ПолучитьОбласть("R"+Формат(НомерСтроки,"ЧГ=0") + "C"+Формат(ПолеСоответствия.Значение,"ЧГ=0")).ТекущаяОбласть;
			ЗначениеЯчейки = СокрЛП(ТекущаяОбласть.Текст);	
			Данные = СокрЛП(ЗначениеЯчейки);
			
			СтруктураДанных.Вставить(ПолеСоответствия.Ключ, Данные);
			СтрокаДанных = СтрокаДанных + Данные;
		КонецЦикла;
		
		Если Не ПустаяСтрока(СтрокаДанных) Тогда	
			Масс.Добавить(СтруктураДанных);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр Из Масс Цикл
		ШаблонСсылка = табАид_ПолучитьШаблон(Стр.Имя);
		Если ШаблонСсылка = Неопределено Тогда
			Шаблон = Справочники.ШаблоныСообщений.СоздатьЭлемент();
		иначе
			Шаблон = ШаблонСсылка.ПолучитьОбъект();
		КонецЕсли;	
		
		Если Стр.Вид = "Email"  Тогда
			Шаблон.ТекстШаблонаПисьма = СтрЗаменить(Стр.Текст,"$",""+Символы.ПС+"");
			Шаблон.ТекстШаблонаПисьмаHTML = Стр.Текст;
			Шаблон.Наименование = Стр.Имя;
			Шаблон.Назначение = "ТАБ АИД";
			Шаблон.ПолноеИмяТипаПараметраВводаНаОсновании = "Обработка.табАид_ВиртуальныйМенеджер";
			Шаблон.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
			Шаблон.ПредназначенДляВводаНаОсновании = Истина;
			Шаблон.ПредназначенДляЭлектронныхПисем = Истина;
			Шаблон.Записать();
		ИначеЕсли Стр.Вид = "SMS"  Тогда   
			Шаблон.ТекстШаблонаSMS = СтрЗаменить(Стр.Текст,"$",""+Символы.ПС+"");
			Шаблон.ТекстШаблонаПисьмаHTML = Стр.Текст;
			Шаблон.Наименование = Стр.Имя;
			Шаблон.Назначение = "ТАБ АИД";
			Шаблон.ПолноеИмяТипаПараметраВводаНаОсновании = "Обработка.табАид_ВиртуальныйМенеджер";
			Шаблон.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
			Шаблон.ПредназначенДляВводаНаОсновании = Истина;
			Шаблон.ПредназначенДляЭлектронныхПисем = Ложь;
			Шаблон.ПредназначенДляSMS = Истина;
			Шаблон.Записать();
		ИначеЕсли Стр.Вид = "ГолосовоеСообщение"  Тогда
			Шаблон.ТекстШаблонаПисьма = СтрЗаменить(Стр.Текст,"$",""+Символы.ПС+"");
			Шаблон.ТекстШаблонаПисьмаHTML = Стр.Текст;
			Шаблон.ТекстШаблонаSMS = СтрЗаменить(Стр.Текст,"$",""+Символы.ПС+"");
			Шаблон.Наименование = Стр.Имя;
			Шаблон.Назначение = "ТАБ АИД";
			Шаблон.ПолноеИмяТипаПараметраВводаНаОсновании = "Обработка.табАид_ВиртуальныйМенеджер";
			Шаблон.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
			Шаблон.ПредназначенДляВводаНаОсновании = Истина;
			Шаблон.ПредназначенДляЭлектронныхПисем = Ложь;
			Шаблон.табАид_ПредназначенДляГолосовогоСообщения = Истина;
			Шаблон.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Функция табАид_ПолучитьШаблон(Имя)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ШаблоныСообщений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	ШаблоныСообщений.ПометкаУдаления = ЛОЖЬ
	|	И ШаблоныСообщений.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",Имя );
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


&НаКлиенте
Процедура табАид_ЗаполнитьШаблоныПоУмолчанию(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("табАид_ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение,"Осознаю и соглашаюсь, что отправка данных текстов должна производиться в строгом соответствии с законодательством РФ. 
	|  Соглашаясь с вышеуказанным условием, несу полную ответственность за распространение шаблонов  текстов.
	|  Компания ""Технологии и Бизнес"" не ответственность за содержание шаблонов текстов и/или ее представители ни при каких 
	|  обстоятельствах не несут ответственности за ущерб любого характера, полученный в результате использования данных текстов.", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура табАид_ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	табАид_ЗаполнитьШаблоныПоУмолчаниюНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

Функция табАид_ПолучитьСоответствиеКолонок()
	
	СоответствиеКолонок = Новый Соответствие;
	
	СоответствиеКолонок.Вставить("Имя", 1);
	СоответствиеКолонок.Вставить("Вид", 2);
	СоответствиеКолонок.Вставить("Текст", 3);
	
	Возврат СоответствиеКолонок;
	
КонецФункции

&НаСервере
Процедура табАид_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.Список.ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникШаблоныСообщений.Ссылка КАК Ссылка,
	|	СправочникШаблоныСообщений.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА СправочникШаблоныСообщений.ПредназначенДляSMS
	|			ТОГДА &СообщениеSMS
	|		КОГДА СправочникШаблоныСообщений.табАид_ПредназначенДляГолосовогоСообщения
	|			ТОГДА &ГолосовоеСообщение
	|		ИНАЧЕ &ЭлектроннаяПочта
	|	КОНЕЦ КАК ШаблонДля,
	|	ВЫБОР
	|		КОГДА СправочникШаблоныСообщений.Назначение = """"
	|			ТОГДА &Общий
	|		ИНАЧЕ СправочникШаблоныСообщений.Назначение
	|	КОНЕЦ КАК Назначение,
	|	СправочникШаблоныСообщений.ВладелецШаблона КАК ВладелецШаблона,
	|	0 КАК ЕстьФайлы
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК СправочникШаблоныСообщений
	|ГДЕ
	|	(&Назначение = """"
	|			ИЛИ СправочникШаблоныСообщений.Назначение = &Назначение)
	|	И (СправочникШаблоныСообщений.ВладелецШаблона = НЕОПРЕДЕЛЕНО
	|			ИЛИ СправочникШаблоныСообщений.ВладелецШаблона = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
	|			ИЛИ &ПоказыватьКонтекстныеШаблоны)";
	
	табАид_ДобавитьКомандыНаСервере();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,"Назначение","ТАБ АИД",,,Истина);
	
КонецПроцедуры
